CSI API ETABS v1
cAreaElm.GetOffsets Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetOffsets(
	string Name,
	ref int OffsetType,
	ref string OffsetPattern,
	ref double OffsetPatternSF,
	ref double[] Offset
)
Function GetOffsets (
	Name As String,
	ByRef OffsetType As Integer,
	ByRef OffsetPattern As String,
	ByRef OffsetPatternSF As Double,
	ByRef Offset As Double()
) As Integer
Dim instance As cAreaElm
Dim Name As String
Dim OffsetType As Integer
Dim OffsetPattern As String
Dim OffsetPatternSF As Double
Dim Offset As Double()
Dim returnValue As Integer
returnValue = instance.GetOffsets(Name,
	OffsetType, OffsetPattern, OffsetPatternSF,
	Offset)
int GetOffsets(
	String^ Name,
	int% OffsetType,
	String^% OffsetPattern,
	double% OffsetPatternSF,
	array<double>^% Offset
)
abstract GetOffsets :
        Name : string *
        OffsetType : int byref *
        OffsetPattern : string byref *
        OffsetPatternSF : float byref *
        Offset : float[] byref -> int
Parameters
Name
Type: System.String
OffsetType
Type: System.Int32
OffsetPattern
Type: System.String
OffsetPatternSF
Type: System.Double
Offset
Type: System.Double[]
Return Value
Type: Int32
See Also
Reference
cAreaElm Interface
ETABSv1 Namespace